axaypatoliya11/stm32-h7a3zi-q-peripherals/Core/Src/main.c
}

/* USER CODE BEGIN 4 */
#ifdef __ALARM__
void HAL_RTC_AlarmAEventCallback(RTC_HandleTypeDef *hrtc)
{
  HAL_UART_Transmit(&huart3, (uint8_t*)alarmMsg, strlen(alarmMsg), UART_TIMEOUT);
}
#endif

#ifdef __WWDG__
void HAL_WWDG_EarlyWakeupCallback(WWDG_HandleTypeDef *hwwdg)
{
	check_loop_count_wwdg+=1;
	if(check_loop_count_wwdg == LOOP_COUNT_WWDG){
		HAL_UART_Transmit(&huart3, "system reboot using watchdog\n", sizeof("system reboot using watchdog\n"), 100);
	}
	else{
		WRITE_REG(hwwdg->Instance->CR, (hwwdg->Init.Counter));
		HAL_UART_Transmit(&huart3, "inside else ISR\n", sizeof("inside else ISR\n"), 100);
		HAL_WWDG_Refresh(&hwwdg1);
	}
}
#endif


#ifdef __TEMPERATURE__
int get_temperature(){
	HAL_ADC_PollForConversion(&hadc2, 1000);
	readValue = HAL_ADC_GetValue(&hadc2);
	int temperature;
	temperature = (int)readValue - (uint32_t)*TS30;
	temperature *= (int)((uint32_t)110 - (uint32_t)30);
	temperature /= (int)(int32_t)((uint32_t)*TS110 - (uint32_t)*TS30);
	temperature += 30;
	return temperature;
}

void transmit_temperature(int temp){
	uint8_t temperature_c[100];
	uint8_t read[100];
	sprintf(temperature_c, "Temperature in Celsius: %d\n", temp);
	sprintf(read, "Temperature read: %d\n", readValue);
	HAL_UART_Transmit(&huart3, temperature_c, strlen(temperature_c), UART_TIMEOUT);
	HAL_UART_Transmit(&huart3, read, strlen(read), UART_TIMEOUT);
}
#endif

#ifdef __RNG__
void gen_random_number(){
	HAL_RNG_GenerateRandomNumber(&hrng, &random32bit_generatedNumber);
	uint8_t rng_data[100] = {0};
	sprintf(rng_data, "Generated random number: %d", random32bit_generatedNumber);
	HAL_UART_Transmit(&huart3, rng_data, strlen(rng_data), UART_TIMEOUT);
	HAL_UART_Transmit(&huart3, "\n", 1, UART_TIMEOUT);
}
#endif

#ifdef __TIME_DATE_ALARM__
void get_time_date(){
	char time[30];
	char date[30];
	HAL_RTC_GetDate(&hrtc, &Date, RTC_FORMAT_BIN);
	sprintf(date, "Date: %02d.%02d.%02d\n", Date.Date, Date.Month, Date.Year);
	HAL_RTC_GetTime(&hrtc, &Time, RTC_FORMAT_BIN);
	sprintf(time, "Time: %02d:%02d:%02d\n", Time.Hours, Time.Minutes, Time.Seconds);
	HAL_UART_Transmit(&huart3, (uint8_t*)date, strlen(date), 5*UART_TIMEOUT);
	HAL_UART_Transmit(&huart3, (uint8_t*)time, strlen(time), 5*UART_TIMEOUT);
}

void set_time_custom(){
	if(HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0) != 0xFF){
		setTime.Hours = 0x11;
		setTime.Minutes = 0x11;
		setTime.Seconds = 0x00;
		HAL_RTC_SetTime(&hrtc, &setTime, RTC_FORMAT_BCD);
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, 0xFF);
	} else{
		uint8_t temp[100] = {0};
		sprintf(temp, "time already set buddy! %d\n", HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0));
		HAL_UART_Transmit(&huart3, temp, strlen(temp), 5*UART_TIMEOUT);
	}
}

void set_date_custom(){
	setDate.Date = 0x23;
	setDate.Month = 0x09;
	setDate.Year = 0x22;
}

void set_alarm_custom(){
	Alarm.Alarm = RTC_ALARM_A;
	Alarm.AlarmTime.Hours = 0x11;
	Alarm.AlarmTime.Minutes = 0x12;
	Alarm.AlarmTime.Seconds = 0x00;
	Alarm.AlarmMask = RTC_ALARMMASK_DATEWEEKDAY;
	HAL_RTC_SetAlarm_IT(&hrtc, &Alarm, RTC_FORMAT_BIN);
	uint8_t temp[] = "alarm set!\n";
	HAL_UART_Transmit(&huart3, (uint8_t*)temp, strlen(temp), 5*UART_TIMEOUT);
}
#endif

#ifdef __FLASH__
void FLASH_Read(uint32_t StartPageAddress, uint32_t *RxBuf, uint16_t numberofwords){
	uint32_t temp;
	while (1)
		{
			*RxBuf = *(__IO uint32_t *)StartPageAddress;
			StartPageAddress+=4;
			RxBuf++;
			if (!(--numberofwords)) break;
		}
}

void Print_readed_data(uint32_t holdMultipleRead[]){
	uint8_t temp_data[10] = {0};
	uint16_t a,b;
	for(int i=0; i<DATA_READ_LOOP; i++){
	  a = holdMultipleRead[i]>>16;
	  b = holdMultipleRead[i] & 0x0000ffff;
	  sprintf(temp_data, "%d\n%d\n", b,a);
	  HAL_UART_Transmit(&huart3, temp_data, strlen(temp_data), UART_TIMEOUT);

  }
}

void FLASH_write(){
	// unlock the flash to write
	  if(HAL_FLASH_Unlock() != HAL_OK){
		  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	  }
	  for(int i=0; i<DATA_TRANSMIT_LOOP; i++){
		  if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_FLASHWORD, (uint32_t)send_address, &buffer_tfs[i*8]) != HAL_OK)
		  {
			  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
		  }
	  send_address+=16;
	}
	// lock the flash once done writing
	if(HAL_FLASH_Unlock() != HAL_OK){
	  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	}
}

void FLASH_clear(){
	if(HAL_FLASH_Unlock() != HAL_OK){
		  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	  }
	  uint32_t PAGEError;
	  FLASH_EraseInitTypeDef EraseInitStruct;
	  EraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
	  EraseInitStruct.NbSectors = 1;
	  EraseInitStruct.Banks = FLASH_BANK_1;
	  EraseInitStruct.Sector = FLASH_SECTOR_127;
	  if(HAL_FLASHEx_Erase(&EraseInitStruct, &PAGEError) != HAL_OK)
	  {
		  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	  }
	  if(HAL_FLASH_Lock() != HAL_OK){
	    HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	  }
}
#endif
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}


#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
